/* The label on the Cancel button in the assertion-failure & throw alerts */
"Abort" = "Abort";

/* The default name for an undoable action. */
"Action" = "Action";

/* Menu item text that allows user to choose all files that can be read by the application. */
"All Readable Files" = "All Readable Files";

/* The message displayed in the assertion-failure alert */
"Assert Message" = "Condition: %1$%2$\n\nFunction: %3$%4$\nFile: %5$%6$\nLine # %7$%8$";

/* The title of the assertion-failure alert */
"Asssertion Failed" = "Asssertion Failed";

/* Error message when a property list file can't be read. */
"B::PropertyListCreateException" = "B::PropertyListCreateException";

/* Generic message when a bad-format-string exception occurs in the  boost format library. */
"boost::bad_format_string" = "boost::bad_format_string";

/* Generic message when an exception occurs in the  boost format library. */
"boost::format_error" = "boost::format_error";

/* Generic message when a out-of-range exception occurs in the  boost format library. */
"boost::out_of_range" = "boost::out_of_range";

/* Generic message when a too-few-arguments exception occurs in the  boost format library. */
"boost::too_few_args" = "boost::too_few_args";

/* Generic message when a too-many-arguments exception occurs in the  boost format library. */
"boost::too_many_args" = "boost::too_many_args";

/* Displayed when there's nothing to redo */
"Can't Redo" = "Can't Redo";

/* Displayed when there's nothing to undo */
"Can't Undo" = "Can't Undo";

/* The label on the OK button in the assertion-failure & throw alerts */
"Continue" = "Continue";

/* The title of the exception-throwing debug alert */
"Exception Thrown" = "Exception Thrown";

/* The default accessibility description for Help buttons. */
"HelpButtonAXDescription" = "HelpButtonAXDescription";

/* An error message describing an out-of-memory situation. */
"Out of memory" = "Out of memory";

/* The label on the Quiet button in the assertion-failure & throw alerts */
"Quiet" = "Quiet";

/* Generic 'Redo' menu item text */
"Redo" = "Redo";

/* Default 'Redo' menu item text when there's a specific action to redo.  %1% holds the name of the action */
"Redo %1%" = "Redo %1$%2$";

/* Generic message when a domain exception occurs. */
"std::domain_error" = "std::domain_error";

/* Generic message when an exception occurs. */
"std::exception" = "std::exception";

/* Generic message when an invalid-argument exception occurs. */
"std::invalid_argument" = "std::invalid_argument";

/* Generic message when an I/O exception occurs. */
"std::ios_base::failure" = "std::ios_base::failure";

/* Generic message when a length exception occurs. */
"std::length_error" = "std::length_error";

/* Generic message when a logic exception occurs. */
"std::logic_error" = "std::logic_error";

/* Generic message when an out-of-range exception occurs. */
"std::out_of_range" = "std::out_of_range";

/* Generic message when an overflow exception occurs. */
"std::overflow_error" = "std::overflow_error";

/* Generic message when a range exception occurs. */
"std::range_error" = "std::range_error";

/* Generic message when a runtime exception occurs. */
"std::runtime_error" = "std::runtime_error";

/* Generic message when an underflow exception occurs. */
"std::underflow_error" = "std::underflow_error";

/* The message displayed in the exception-throwing debug alert */
"Throw Message" = "Message: %1$%2$\nWhat: %3$%4$\nError: %5$%6$\n\nFunction: %7$%8$\nFile: %9$%10$\nLine # %11$%12$";

/* Generic 'Undo' menu item text */
"Undo" = "Undo";

/* Default 'Undo' menu item text when there's a specific action to undo.  %1% holds the name of the action */
"Undo %1%" = "Undo %1$%2$";

/* An error message displayed when something went wrong but we don't know what. */
"Unknown exception" = "Unknown exception";

